# LinkElementId Methods

---
The LinkElementId type exposes the following members.
| Name| Description
---|---|---
| Equals|  Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object))
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
LinkElementId Class
Autodesk.Revit.DB Namespace